---
kind: method
id: M:Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.Dispose
source: html/4496372d-3c06-0392-eb61-ef85f999c5ae.htm
---
# Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIDataItem.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryPressureDropUIDataItem

## Syntax (C#)
```csharp
public void Dispose()
```